Autodesk.Revit.DB.SetComparisonResult.Superset
Both sets are not empty and the left set is a strict superset of the right.

Autodesk.Revit.DB.SetComparisonResult.Subset
Both sets are not empty and the left set is strict subset of the right.

Autodesk.Revit.DB.SetComparisonResult.Overlap
The overlap of two sets is not empty and is a strict subset of both.